26-rails-api/movies-api/app/controllers/api/v1/movies_controller.rb

  def create
    movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "year", "score", "imageUrl", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    movie = Movie.find(params[:id])

    movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "score" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["score", 20], ["updated_at", "2020-06-08 15:43:25.369708"], ["id", 1]]